{
  "date": "2023-01-13T04:56:12.453Z",
  "title": "Bringing Agile and Scrum to Data Science and Machine Learning",
  "description": "Software Engineering and Data Science; while both fields require experience using code and technology to drive business value, Agile works well for one, but it can be challenging for the other. As an agile consultant in the innovation space, these are my thoughts on how to reap the benefits of Agile while making sure your Data Scientists are not nerfed.",
  "image": "/images/pexels-thisisengineering-3862603.jpg",
  "body": "# Why Agile is Great For Developing Software\n\nAgile prioritizes delivering a minimum viable product as soon as possible, and then continuously refining and adding to it based on feedback from customers and stakeholders. This allows teams to respond to changes and new information in real-time, resulting in a better end product that more accurately meets the needs of the users.\n\nSoftware behavior, is quite **deterministic**. It's easy to come up with and estimation, have a solid set of requirements, and also prioritize what features are are import and and what are not.\n\nWith the competent team of product and engineers, you can always add new features ever week where its gains can be realized by the users.\n\n# Why Agile tends to Suck for Research\n\nDoing Machine Learning and Data Science is not a building paradigm. It's a research paradigm. This involves a different way of thinking, and most importantly, its **probabilistic**.\n\n- The ask is often too broad\n- Research takes time\n- One is deterministic, the other is probabilistic\n\nShowlife Cycle\n\nStake holders are unsatisfied by the lack of transparency, or commitment to value\nData Scientists are \n\n# Why it doesn't have to\n\n\n\n# What can you do\n\n- Show aspects of the lifecycle \n- Embrace the scientific method\n- Democratize bubble up knowledge to others in you team\n- Automate, DEV OPS\n- Invest time in tooling that can make it easier for you to report\n- Leave room in your backlog to pivot\n- Think about stories as running an experiment\n- Hire and use junior engineers to develop these experiments\n"
}