{
  "date": "2022-12-29T18:12:35.171Z",
  "title": "Building a CMS Powered Blog With Create React App and Netlify",
  "description": "This guide will show you how you can setup your own blogging website using Create a React App and Netlify. We take advantage of Netlify's easy to use CMS and hosting platform, and Create a React Apps flexibility. This makes the setup as simple as possible so you can start blogging immediately, while still allowing room for further customization and adding new features to your Web App.",
  "image": "/images/react-plus-netlify.png",
  "body": "https://brave-curie-12345.netlify.app/.https://brave-curie-12345.netlify.app/.https://youtu.be/p6h-rYSVX90## Architecture\n\n![](/images/cra_netlify_arch.png)\n\n* Github as acts as the repository and version control tool for all our code\n* Netlify hosts the static Web Assets and makes your Application publicly accessible. The following are hosted:\n\n  * Main webpage (includes Landing Page and Blogs) is written in React\n  * Web page embedded with Netlify CMS UI is hosted\n* Netlify Identity is used so the owner of the application can login and use the Netlify CMS securely\n* Netlify Functions is a feature that makes it easy for you to set up JS functions that can be triggered by an API request\n\n## G﻿etting Started\n\nHere's how you can set up and use this Application for your self\n\n### Step 01: Copy Repo to Github\n\nClone or fork <https://github.com/gugzkumar/create-react-app-with-netlify-cms>\n\n### Step 02: Create a Netlify Account\n\nCreate an account in [Netlify](https://www.netlify.com) if you don’t have one\n\n### Step 03: Set up your site in Netlify\n\nFollow the instructions in <https://docs.netlify.com/welcome/add-new-site/> for importing from an existing repository. Use your github repository from step 1.\n\n\n\n## Using and Adding New Features\n\n### Folder Structure\n\n```\ncmsContent/\n  |--blogs/\nnetlify/\n  |--functions/\npublic/\n  |--admin/\n    |--config.yml\n  |--content/\nsrc/\n  |--pages/\n  |--components/\n  |--cmsConfigs/\n  |--App.js/\npackage.json\nnetlify.toml\nbuildCMSContent.js\n```\n\n### Running Locally\n\n* Having node is installed is pre-requisite for running the app locally\n* Install the netlify cli \\`npm install netlify-cli -g\\`\n* Install all dependencies: `npm install`\n* Run `netlify dev`\n* The application is now hosted statically on <http://localhost:8000>\n\n### Adding a new blog\n\n### Adding a new collection for the CMS\n\n### Styling"
}